In [1]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa

Collecting sqlalchemy==1.3.9
  Downloading https://files.pythonhosted.org/packages/89/4e/f10fc5063d1048b3813c0caf99f06ec2b73851ae1a939feb85315dacb3fc/SQLAlchemy-1.3.9.tar.gz (6.0MB)
     |████████████████████████████████| 6.0MB 18.6MB/s eta 0:00:01
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Stored in directory: /home/jupyterlab/.cache/pip/wheels/23/84/f4/c15e90bd4c87e0377dad50e670f4535715550f6fc3be27ea0f
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Found existing installation: SQLAlchemy 1.4.15
    Uninstalling SQLAlchemy-1.4.15:
      Successfully uninstalled SQLAlchemy-1.4.15
Successfully installed sqlalchemy-1.3.9
Requirement already satisfied: ibm_db_sa in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.3)
Requirement already satisfied: sqlalchemy>=0.7.3 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ibm_db_sa) (1.3.9)

In [2]:
%load_ext sql

In [3]:
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name
%sql ibm_db_sa://msb52107:59kj282nqkg1h2-d@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB

'Connected: msb52107@BLUDB'

--Exercise

## 1. Problem:

### Select the names and job start dates of all employees who work for the department number 5.

#### Hint:

>Use the Inner join operation with the EMPLOYEES table as the left table and the JOB_HISTORY table as the right table.

In [4]:
%%sql

select E.F_NAME,E.L_NAME, JH.START_DATE 
from EMPLOYEES as E 
INNER JOIN JOB_HISTORY as JH on E.EMP_ID=JH.EMPL_ID 
where E.DEP_ID ='5';

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1)),
 ('Steve', 'Wells', datetime.date(2001, 8, 16)),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16)),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16))]

## 2. Problem:

### Select the names, job start dates, and job titles of all employees who work for the department number 5.

### Hint:
>Perform an INNER JOIN with 3 tables – EMPLOYEES, JOB_HISTORY, JOBS.*

In [9]:
%%sql
select E.F_NAME,E.L_NAME, JH.START_DATE, J.JOB_TITLE 
from EMPLOYEES as E 
INNER JOIN JOB_HISTORY as JH on E.EMP_ID=JH.EMPL_ID 
INNER JOIN JOBS as J on E.JOB_ID=J.JOB_IDENT
where E.DEP_ID ='5';

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('Alice', 'James', datetime.date(2001, 8, 1), 'Sr.Software Dev'),
 ('Ann', 'Jacob', datetime.date(2016, 8, 16), 'Sr. Designer'),
 ('Steve', 'Wells', datetime.date(2001, 8, 16), 'Jr.Software Dev'),
 ('Santosh', 'Kumar', datetime.date(2000, 8, 16), 'Jr.Software Dev')]

## 3. Problem:
    
### Perform a Left Outer Join on the EMPLOYEES and DEPARTMENT tables and select employee id, last name, department id and department name for all employees.

### Hint
>Use the Left Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table.

In [7]:
%%sql

select E.EMP_ID, E.L_NAME, E.DEP_ID, D.DEP_NAME
from EMPLOYEEs as E
LEFT OUTER JOIN DEPARTMENTS as D on E.DEP_ID = D.DEPT_ID_DEP;

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', 'Architect Group'),
 ('E1005    ', 'Hussain', '2        ', 'Architect Group'),
 ('E1002    ', 'James', '5        ', 'Software Group'),
 ('E1010    ', 'Jacob', '5        ', 'Software Group'),
 ('E1004    ', 'Kumar', '5        ', 'Software Group'),
 ('E1003    ', 'Wells', '5        ', 'Software Group'),
 ('E1007    ', 'Thomas', '7        ', 'Design Team'),
 ('E1009    ', 'Jones', '7        ', 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', 'Design Team')]

## 4. Problem:

### Re-write the previous query but limit the result set to include only the rows for employees born before 1980.

## Hint

>Use a WHERE clause and Left Outer Join operation. Alternatively, you could also use an INNER JOIN.

In [12]:
%%sql

select E.EMP_ID, E.L_NAME, E.DEP_ID,E.B_DATE, D.DEP_NAME
from EMPLOYEEs as E
LEFT OUTER JOIN DEPARTMENTS as D on E.DEP_ID = D.DEPT_ID_DEP
where YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', datetime.date(1976, 1, 9), 'Architect Group'),
 ('E1006    ', 'Allen', '2        ', datetime.date(1978, 2, 6), 'Architect Group'),
 ('E1002    ', 'James', '5        ', datetime.date(1972, 7, 31), 'Software Group'),
 ('E1007    ', 'Thomas', '7        ', datetime.date(1975, 5, 5), 'Design Team')]

## 5. Problem:

### Re-write the previous query but have the result set include all the employees but department names for only the employees who were born before 1980.
---
## Hint
>Use an AND in the LEFT OUTER JOIN clause.

In [13]:
%%sql

select E.EMP_ID, E.L_NAME, E.DEP_ID,E.B_DATE, D.DEP_NAME
from EMPLOYEEs as E
LEFT OUTER JOIN DEPARTMENTS as D on E.DEP_ID = D.DEPT_ID_DEP
And YEAR(E.B_DATE) < 1980;

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'Thomas', '2        ', datetime.date(1976, 1, 9), 'Architect Group'),
 ('E1002    ', 'James', '5        ', datetime.date(1972, 7, 31), 'Software Group'),
 ('E1003    ', 'Wells', '5        ', datetime.date(1980, 8, 10), None),
 ('E1004    ', 'Kumar', '5        ', datetime.date(1985, 7, 20), None),
 ('E1005    ', 'Hussain', '2        ', datetime.date(1981, 1, 4), None),
 ('E1006    ', 'Allen', '2        ', datetime.date(1978, 2, 6), 'Architect Group'),
 ('E1007    ', 'Thomas', '7        ', datetime.date(1975, 5, 5), 'Design Team'),
 ('E1008    ', 'Gupta', '7        ', datetime.date(1985, 5, 6), None),
 ('E1009    ', 'Jones', '7        ', datetime.date(1990, 7, 9), None),
 ('E1010    ', 'Jacob', '5        ', datetime.date(1982, 3, 30), None)]

## 6. Problem:

### Perform a Full Join on the EMPLOYEES and DEPARTMENT tables and select the First name, Last name and Department name of all employees.

---

## Hint:

>Use the Full Outer Join operation with the EMPLOYEES table as the left table and the DEPARTMENTS table as the right table.

In [15]:
%%sql

select E.F_NAME,E.L_NAME, D.DEP_NAME
from EMPLOYEES as E
FUll OUTER JOIN DEPARTMENTS as D on E.DEP_ID = D.DEPT_ID_DEP;

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', 'Architect Group'),
 ('Alice', 'James', 'Software Group'),
 ('Steve', 'Wells', 'Software Group'),
 ('Santosh', 'Kumar', 'Software Group'),
 ('Ahmed', 'Hussain', 'Architect Group'),
 ('Nancy', 'Allen', 'Architect Group'),
 ('Mary', 'Thomas', 'Design Team'),
 ('Bharath', 'Gupta', 'Design Team'),
 ('Andrea', 'Jones', 'Design Team'),
 ('Ann', 'Jacob', 'Software Group')]

### 7. Problem:

## Re-write the previous query but have the result set include all employee names but department id and department names only for male employees.
---

### HINT:

>Add an AND in Query 3A to filter on male employees in the ON clause. Alternatively, you can also use Left Outer Join.

In [21]:
%%sql

select E.F_NAME,E.L_NAME,D.DEPT_ID_DEP,D.DEP_NAME
from EMPLOYEES as E
FUll OUTER JOIN DEPARTMENTS as D on E.DEP_ID = D.DEPT_ID_DEP
AND E.SEX = 'M';

 * ibm_db_sa://msb52107:***@dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', '2        ', 'Architect Group'),
 ('Steve', 'Wells', '5        ', 'Software Group'),
 ('Santosh', 'Kumar', '5        ', 'Software Group'),
 ('Ahmed', 'Hussain', '2        ', 'Architect Group'),
 ('Bharath', 'Gupta', '7        ', 'Design Team'),
 ('Alice', 'James', None, None),
 ('Nancy', 'Allen', None, None),
 ('Mary', 'Thomas', None, None),
 ('Andrea', 'Jones', None, None),
 ('Ann', 'Jacob', None, None)]